Ran Plan for 3 projects:

1. dir: `Project_1` workspace: `default`
1. dir: `.` workspace: `default`
1. dir: `Project_2` workspace: `default`

### 1. dir: `Project_1` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.bucket_creation[0].google_storage_bucket.bucket1 will be created
+ resource "google_storage_bucket" "bucket1" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "gcloud-bucket-using-tl123-p1"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "REGIONAL"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 15
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = "ANY"
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.bucket_creation[0].google_storage_bucket_object.object1 will be created
+ resource "google_storage_bucket_object" "object1" {
      + bucket         = "gcloud-bucket-using-tl123-p1"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "sample_image"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "image1.png"
      + storage_class  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Project_1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252FProject_1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Project_1`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`

---
### 3. dir: `Project_2` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/yashwanthm998/atlantis/12/default/Project_2/default.tfplan\"" in "/home/atlantis/.atlantis/repos/yashwanthm998/atlantis/12/default/Project_2": exit status 1

Error: "gcloud-bucket-using-tl123 -p2" name value can only contain lowercase letters, numeric characters, dashes (-), underscores (_), and dots (.)

  with module.bucket_creation[0].google_storage_bucket.bucket1,
  on ../modules/Buckets/main.tf line 2, in resource "google_storage_bucket" "bucket1":
   2:   name = var.bucket.bucket_name


```

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
